ХМНПФ_Общее/Documents/уп_РаспределениеИДОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РаспределениеИДОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИсточникИД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыИсточниковНачисленияИДОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВГоду</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорыОПС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РублеДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПроцентДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>15</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаДохода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/CommonModules/уп_ОбработчикУдаления/Ext/Module.bsl
//ЛыткинАМ //[GLPI #0007905] Новая заявка 1 С //Открепить решение из основания при пометке на уделение
Процедура ХМ_ОткрепитьРешениеВДокументОснование(ДокументОснование, Решение) Экспорт
	 
	 //// Перед обновлением требуется снять дату запрета изменения данных
	 //ПараметрыСеанса.ГраницыЗапретаИзмененияДанных = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(0));
	
	 Если ДокументОснование.ПринятоеРешение = Решение Тогда 
		 ДокОснОбъект = ДокументОснование.ПолучитьОбъект();
		 ДокОснОбъект.ПринятоеРешение = Неопределено;
		 ДокОснОбъект.ОтказаноВВыплате = Ложь;
		 ДокОснОбъект.Записать();
	КонецЕсли;	 
	 
	 // Вернуть дату запрета изменения данных
	 //ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
	 
 Конецпроцедуры	
 
 &ИзменениеИКонтроль("ЗаписатьДанныеВДокументыИДПДС")
 Процедура ХМ_ЗаписатьДанныеВДокументыИДПДС(НовыеНачисления,ДопПараметры)    Экспорт
	#Вставка
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
	ФактическаяСуммаРаспределения = 0;
	#КонецВставки
	 //сначала если не фиксирован процент, то нужно прописать в таблицы
	 Для каждого стрНач из НовыеНачисления Цикл
		 //составляем таблицу строк документов с отбором по строке таблицы начисления
		 //Составим текст условия
		 ТекстУсловия = "";
		 Если ДопПараметры.ГруппаДоговоров Тогда
			 ТекстУсловия = ТекстУсловия+" И уп_РаспределениеИДСписокСчетов.ПенсионныйДоговор.Родитель = &ГруппаДоговоров ";
		 КонецЕсли;
		 Если ДопПараметры.ПенсионныйДоговор ИЛИ ЗначениеЗаполнено(ДопПараметры.ОтборПенсионныйДоговор) Тогда
			 ТекстУсловия = ТекстУсловия+" И уп_РаспределениеИДСписокСчетов.ПенсионныйДоговор В ИЕРАРХИИ (&ПенсионныйДоговор) ";
		 КонецЕсли;	
		 Если ДопПараметры.ТипРезерва ИЛИ ЗначениеЗаполнено(ДопПараметры.ОтборТипРезерва) Тогда
			 ТекстУсловия = ТекстУсловия+" И уп_РаспределениеИДСписокСчетов.ТипРезерва = &ТипРезерва ";
		 КонецЕсли;
		 Если ДопПараметры.Схема Тогда
			 ТекстУсловия = ТекстУсловия+" И уп_РаспределениеИДСписокСчетов.Схема = &Схема ";
		 КонецЕсли; 
		 Если ЗначениеЗаполнено(ДопПараметры.ОтборПодразделение) Тогда
			 ТекстУсловия = ТекстУсловия + "
			 |	И уп_РаспределениеИДСписокСчетов.Ссылка.ПодразделениеОрганизации В ИЕРАРХИИ (&ОтборПодразделение)";
		 КонецЕсли; 
		 Если ДопПараметры.ИнвестиционнаяСтратегия или ЗначениеЗаполнено(ДопПараметры.ОтборИнвестиционнаяСтратегия) Тогда
			 ТекстУсловия = ТекстУсловия + "
			 |	И уп_РаспределениеИДСписокСчетов.Ссылка.ИнвестиционнаяСтратегия = &ИнвестиционнаяСтратегия";
		 КонецЕсли;
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	уп_РаспределениеИДСписокСчетов.Ссылка КАК Ссылка,
		 |	уп_РаспределениеИДСписокСчетов.НомерСчета,
		 |	уп_РаспределениеИДСписокСчетов.ПенсионныйДоговор КАК ПенсионныйДоговор,
		 |	уп_РаспределениеИДСписокСчетов.РублеДни КАК РублеДни,
		 |	уп_РаспределениеИДСписокСчетов.ТипСуммы,
		 |	уп_РаспределениеИДСписокСчетов.НомерСтроки КАК НомерСтроки,
		 |	уп_РаспределениеИДСписокСчетов.Ссылка.ТипРезерва,
		 |	уп_РаспределениеИДСписокСчетов.Схема КАК Схема, 
		 |	уп_РаспределениеИДСписокСчетов.Ссылка.ИнвестиционнаяСтратегия КАК ИнвестиционнаяСтратегия
		 |ИЗ
		 |	Документ.пдс_РаспределениеИД.СписокСчетов КАК уп_РаспределениеИДСписокСчетов
		 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пдс_ПараметрыДоговораПДС.СрезПоследних(&ДатаКон, ) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
		 |		ПО уп_РаспределениеИДСписокСчетов.ПенсионныйДоговор = уп_ПараметрыПенсионногоДоговораСрезПоследних.ДоговорПДС 
		 |ГДЕ
		 |	уп_РаспределениеИДСписокСчетов.Ссылка.Дата >= &ДатаНач
		 |	И уп_РаспределениеИДСписокСчетов.Ссылка.Дата <= &ДатаКон
		 |	И уп_РаспределениеИДСписокСчетов.Ссылка.Проведен = ЛОЖЬ
		 |	И уп_РаспределениеИДСписокСчетов.Ссылка.Организация = &Организация
		 |	И уп_РаспределениеИДСписокСчетов.Ссылка.ПометкаУдаления = ЛОЖЬ  "+ТекстУсловия+"
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	НомерСтроки
		 |ИТОГИ
		 |	СУММА(РублеДни)
		 |ПО
		 |	ОБЩИЕ,
		 |	Ссылка";
		 
		 Запрос.УстановитьПараметр("ГруппаДоговоров", стрНач.ГруппаДоговоров);
		 Если ЗначениеЗаполнено(ДопПараметры.ОтборПенсионныйДоговор) Тогда
			 Запрос.УстановитьПараметр("ПенсионныйДоговор", ДопПараметры.ОтборПенсионныйДоговор);
		 Иначе
			 Запрос.УстановитьПараметр("ПенсионныйДоговор", стрНач.ПенсионныйДоговор);
		 КонецЕсли;
		 Если ЗначениеЗаполнено(ДопПараметры.ОтборТипРезерва) Тогда
			 Запрос.УстановитьПараметр("ТипРезерва", ДопПараметры.ОтборТипРезерва);
		 Иначе
			 Запрос.УстановитьПараметр("ТипРезерва", стрНач.ТипРезерва);
		 КонецЕсли;
		 Запрос.УстановитьПараметр("Схема", стрНач.Схема);
		 Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДопПараметры.ДатаФормированияДокументов));
		 Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДопПараметры.ДатаФормированияДокументов));
		 Запрос.УстановитьПараметр("Организация", ДопПараметры.Организация);  
		 Если ЗначениеЗаполнено(ДопПараметры.ОтборИнвестиционнаяСтратегия) Тогда
			 Запрос.УстановитьПараметр("ИнвестиционнаяСтратегия", ДопПараметры.ОтборИнвестиционнаяСтратегия); 
		 Иначе
			 Запрос.УстановитьПараметр("ИнвестиционнаяСтратегия", стрНач.ИнвестиционнаяСтратегия); 
		 Конецесли;
		 Запрос.УстановитьПараметр("ОтборПодразделение", ДопПараметры.ОтборПодразделение); 
		 
		 Результат = Запрос.Выполнить();
		 
		 Если Не стрНач.ФиксПроцент Тогда
			 ОсталосьРаспределить = СтрНач.Сумма;
			 ОсталосьРубледней = СтрНач.РублеДни;
			 
			 ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			 ВыборкаОбщийИтог.Следующий();		// Общий итог
			 
			 Если ВыборкаОбщийИтог.РублеДни = ОсталосьРубледней Тогда //все в порядке, суммы совпадают при расчете и реальном распределении			
				 ВыборкаСсылка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				 Пока ВыборкаСсылка.Следующий() Цикл  //выбираем документы
					 ДокОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
					 //РублеДниНаДок = ВыборкаСсылка.РублеДни;
					 
					 ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
					 //КолСтрок = ВыборкаДетальныеЗаписи.Количество();
					 //НомСтр = 0;
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  //выбираем строки документа
						 //НомСтр = НомСтр+1;
						 Если  ОсталосьРублеДней<>0 Тогда
							 Проц = ОсталосьРаспределить*ДопПараметры.ДнейВГоду*100/ОсталосьРублеДней;
						 Иначе
							 Проц = 0;
						 КонецЕсли;
						 //ищем строку
						 стр = ДокОбъект.СписокСчетов.Найти(ВыборкаДетальныеЗаписи.НомерСтроки,"НомерСтроки");
						 Если стр<>Неопределено Тогда
							 стр.ПроцентДохода = Проц;
							#Вставка
							//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
							Если ДопПараметры.Свойство("ХМ_ЗаполнитьОбщимПроцентом") И ДопПараметры.ХМ_ЗаполнитьОбщимПроцентом Тогда
								стр.ПроцентДохода = ДопПараметры.ХМ_ОбщийПроцент;
							КонецЕсли;
							#КонецВставки
							 Если ОсталосьРублеДней = ВыборкаДетальныеЗаписи.РублеДни Тогда
								 стр.СуммаДохода = ОсталосьРаспределить;
								 ОсталосьРубледней = ОсталосьРубледней-стр.РублеДни;
							 Иначе
								 стр.СуммаДохода = ОКР(стр.РублеДни*Проц/(ДопПараметры.ДнейВГоду*100),2,1);
								 ОсталосьРаспределить = ОсталосьРаспределить-стр.СуммаДохода;
								 ОсталосьРубледней = ОсталосьРубледней-стр.РублеДни;
							 КонецЕсли;
						 КонецЕсли;
					 КонецЦикла;
					 //перед записью средний процент и суммарный доход
					 ДокОбъект.СуммаДохода = ДокОбъект.СписокСчетов.Итог("СуммаДохода");
					 Если ДокОбъект.СписокСчетов.Итог("Рубледни")<>0 Тогда 
						 ДокОбъект.ПроцентДохода = ДокОбъект.СуммаДохода*ДопПараметры.ДнейВГоду*100/ДокОбъект.СписокСчетов.Итог("Рубледни");
						#Вставка
						//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
						Если ДопПараметры.Свойство("ХМ_ЗаполнитьОбщимПроцентом") И ДопПараметры.ХМ_ЗаполнитьОбщимПроцентом Тогда
							ДокОбъект.ПроцентДохода = ДопПараметры.ХМ_ОбщийПроцент;
						КонецЕсли;
						ФактическаяСуммаРаспределения = ФактическаяСуммаРаспределения + ДокОбъект.СуммаДохода;
						#КонецВставки
					 КонецЕсли;
					 ДокОбъект.ОбменДанными.Загрузка = Истина;
					 ДокОбъект.Записать();
				 КонецЦикла;
			 Иначе
				 Сообщить("Некорректное распределение.");
			 КонецЕсли;
		 Иначе
			 ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			 ВыборкаОбщийИтог.Следующий();		// Общий итог
			 ОсталосьРубледней = СтрНач.РублеДни;
			 
			 Если ВыборкаОбщийИтог.РублеДни = ОсталосьРубледней Тогда //все в порядке, суммы совпадают при расчете и реальном распределении			
				 ВыборкаСсылка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				 Пока ВыборкаСсылка.Следующий() Цикл  //выбираем документы
					 ДокОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
					 //РублеДниНаДок = ВыборкаСсылка.РублеДни;
					 
					 ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  //выбираем строки документа
						 //НомСтр = НомСтр+1;
						 //ищем строку
						 стр = ДокОбъект.СписокСчетов.Найти(ВыборкаДетальныеЗаписи.НомерСтроки,"НомерСтроки");
						 Если стр<>Неопределено Тогда
							 стр.ПроцентДохода = стрНач.Процент;
							 стр.СуммаДохода = ОКР(стр.РублеДни*стрНач.Процент/(ДопПараметры.ДнейВГоду*100),2,1);
						 КонецЕсли;
					 КонецЦикла;
					 //перед записью средний процент и суммарный доход
					 ДокОбъект.СуммаДохода = ДокОбъект.СписокСчетов.Итог("СуммаДохода");
					 Если ДокОбъект.СписокСчетов.Итог("Рубледни")<>0 Тогда 
						 ДокОбъект.ПроцентДохода = ДокОбъект.СуммаДохода*ДопПараметры.ДнейВГоду*100/ДокОбъект.СписокСчетов.Итог("Рубледни");
					 КонецЕсли;
					#Вставка
					//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
					ФактическаяСуммаРаспределения = ФактическаяСуммаРаспределения + ДокОбъект.СуммаДохода;
					#КонецВставки
					 ДокОбъект.ОбменДанными.Загрузка = Истина;
					 ДокОбъект.Записать();
				 КонецЦикла;
			 Иначе
				 Сообщить("Некорректное распределение.");
			 КонецЕсли;
		 КонецЕсли;	
	 КонецЦикла;
  	#Вставка
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
	Сообщить("Фактическая сумма распределение = "+ФактическаяСуммаРаспределения);
	#КонецВставки
КонецПроцедуры
 
 &ИзменениеИКонтроль("ЗаписатьДанныеВДокументыИД")
 Процедура ХМ_ЗаписатьДанныеВДокументыИД(НовыеНачисления,Организация,ДнейВГоду,ДатаФормированияДокументов,ГруппаДоговоров,ДоговорОПС,ТипРезерва,ОтборТипРезерва)    Экспорт
	#Вставка
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
	Если ТипЗнч(Организация) = Тип("Структура") Тогда
		ДопПараметры = Организация;
		Организация = ДопПараметры.Организация;
	Иначе
		ДопПараметры = Новый Структура();
	КонецЕсли;
	ФактическаяСуммаРаспределения = 0;
	#КонецВставки
	 //сначала если не фиксирован процент, то нужно прописать в таблицы
	 Для каждого стрНач из НовыеНачисления Цикл
		 //составляем таблицу строк документов с отбором по строке таблицы начисления
		 //Составим текст условия
		 ТекстУсловия = "";
		 Если ГруппаДоговоров Тогда
			 ТекстУсловия = ТекстУсловия+" И уп_РаспределениеИДОПСДоговорыОПС.ДоговорОПС В ИЕРАРХИИ(&ГруппаДоговоров) ";
		 КонецЕсли;
		 Если ДоговорОПС Тогда
			 ТекстУсловия = ТекстУсловия+" И уп_РаспределениеИДОПСДоговорыОПС.ДоговорОПС = &ДоговорОПС ";
		 КонецЕсли;	
		 Если ТипРезерва ИЛИ ЗначениеЗаполнено(ОтборТипРезерва) Тогда
			 ТекстУсловия = ТекстУсловия+" И уп_РаспределениеИДОПСДоговорыОПС.Ссылка.ТипРезерва = &ТипРезерва ";
		 КонецЕсли;	
		 
		 Запрос = Новый Запрос;
		 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	уп_РаспределениеИДОПСДоговорыОПС.Ссылка КАК Ссылка,
		 |	уп_РаспределениеИДОПСДоговорыОПС.ДоговорОПС,
		 |	уп_РаспределениеИДОПСДоговорыОПС.РублеДни КАК РублеДни,
		 |	уп_РаспределениеИДОПСДоговорыОПС.ТипСуммы,
		 |	уп_РаспределениеИДОПСДоговорыОПС.НомерСтроки КАК НомерСтроки,
		 |	уп_РаспределениеИДОПСДоговорыОПС.Ссылка.ТипРезерва
		 |ИЗ
		 |	Документ.уп_РаспределениеИДОПС.ДоговорыОПС КАК уп_РаспределениеИДОПСДоговорыОПС
		 |ГДЕ
		 |	уп_РаспределениеИДОПСДоговорыОПС.Ссылка.Дата >= &ДатаНач
		 |	И уп_РаспределениеИДОПСДоговорыОПС.Ссылка.Дата <= &ДатаКон
		 |	И уп_РаспределениеИДОПСДоговорыОПС.Ссылка.Проведен = ЛОЖЬ
		 |	И уп_РаспределениеИДОПСДоговорыОПС.Ссылка.Организация = &Организация
		 |	И уп_РаспределениеИДОПСДоговорыОПС.Ссылка.ПометкаУдаления = ЛОЖЬ  "+ТекстУсловия+"
		 |
		 |УПОРЯДОЧИТЬ ПО
		 |	НомерСтроки
		 |ИТОГИ
		 |	СУММА(РублеДни)
		 |ПО
		 |	ОБЩИЕ,
		 |	Ссылка";
		 
		 Запрос.УстановитьПараметр("ГруппаДоговоров", стрНач.ГруппаДоговоров);
		 Запрос.УстановитьПараметр("ДоговорОПС", стрНач.ДоговорОПС);
		 Если ЗначениеЗаполнено(ОтборТипРезерва) Тогда
			 Запрос.УстановитьПараметр("ТипРезерва", ОтборТипРезерва);
		 Иначе
			 Запрос.УстановитьПараметр("ТипРезерва", стрНач.ТипРезерва);
		 КонецЕсли;
		 Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаФормированияДокументов));
		 Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаФормированияДокументов));
		 Запрос.УстановитьПараметр("Организация", Организация);
		 
		 Результат = Запрос.Выполнить();
		 
		 Если Не стрНач.ФиксПроцент Тогда
			 ОсталосьРаспределить = СтрНач.Сумма;
			 ОсталосьРубледней = СтрНач.РублеДни;
			 
			 ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			 ВыборкаОбщийИтог.Следующий();		// Общий итог
			 
			 Если ВыборкаОбщийИтог.РублеДни = ОсталосьРубледней Тогда //все в порядке, суммы совпадают при расчете и реальном распределении			
				 ВыборкаСсылка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				 Пока ВыборкаСсылка.Следующий() Цикл  //выбираем документы
					 ДокОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
					 //РублеДниНаДок = ВыборкаСсылка.РублеДни;
					 
					 ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
					 //КолСтрок = ВыборкаДетальныеЗаписи.Количество();
					 //НомСтр = 0;
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  //выбираем строки документа
						 //НомСтр = НомСтр+1;
						 Если  ОсталосьРублеДней<>0 Тогда
							 Проц = ОсталосьРаспределить*ДнейВГоду*100/ОсталосьРублеДней;
						 Иначе
							 Проц = 0;
						 КонецЕсли;
						 //ищем строку
						 стр = ДокОбъект.ДоговорыОПС.Найти(ВыборкаДетальныеЗаписи.НомерСтроки,"НомерСтроки");
						 Если стр<>Неопределено Тогда
							 стр.ПроцентДохода = Проц;
							#Вставка
							//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
							Если ДопПараметры.Свойство("ХМ_ЗаполнитьОбщимПроцентом") И ДопПараметры.ХМ_ЗаполнитьОбщимПроцентом Тогда
								стр.ПроцентДохода = ДопПараметры.ХМ_ОбщийПроцент;
							КонецЕсли;
							#КонецВставки
							 Если ОсталосьРублеДней = ВыборкаДетальныеЗаписи.РублеДни Тогда
								 стр.СуммаДохода = ОсталосьРаспределить;
								 ОсталосьРубледней = ОсталосьРубледней-стр.РублеДни;
							 Иначе
								 стр.СуммаДохода = ОКР(стр.РублеДни*Проц/(ДнейВГоду*100),2,1);
								 ОсталосьРаспределить = ОсталосьРаспределить-стр.СуммаДохода;
								 ОсталосьРубледней = ОсталосьРубледней-стр.РублеДни;
							 КонецЕсли;
						 КонецЕсли;
					 КонецЦикла;
					 //перед записью средний процент и суммарный доход
					 ДокОбъект.СуммаДохода = ДокОбъект.ДоговорыОПС.Итог("СуммаДохода");
					 Если ДокОбъект.ДоговорыОПС.Итог("Рубледни")<>0 Тогда 
						 ДокОбъект.ПроцентДохода = ДокОбъект.СуммаДохода*ДнейВГоду*100/ДокОбъект.ДоговорыОПС.Итог("Рубледни");
					 КонецЕсли;
					#Вставка
					//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
					Если ДопПараметры.Свойство("ХМ_ЗаполнитьОбщимПроцентом") И ДопПараметры.ХМ_ЗаполнитьОбщимПроцентом Тогда
						ДокОбъект.ПроцентДохода = ДопПараметры.ХМ_ОбщийПроцент;
					КонецЕсли;
					ФактическаяСуммаРаспределения = ФактическаяСуммаРаспределения + ДокОбъект.СуммаДохода;
					#КонецВставки
					 ДокОбъект.ОбменДанными.Загрузка = Истина;
					 ДокОбъект.Записать();
				 КонецЦикла;
			 Иначе
				 Сообщить("Некорректное распределение.");
			 КонецЕсли;
		 Иначе
			 ВыборкаОбщийИтог = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			 ВыборкаОбщийИтог.Следующий();		// Общий итог
			 ОсталосьРубледней = СтрНач.РублеДни;
			 
			 Если ВыборкаОбщийИтог.РублеДни = ОсталосьРубледней Тогда //все в порядке, суммы совпадают при расчете и реальном распределении			
				 ВыборкаСсылка = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				 Пока ВыборкаСсылка.Следующий() Цикл  //выбираем документы
					 ДокОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
					 //РублеДниНаДок = ВыборкаСсылка.РублеДни;
					 
					 ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
					 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  //выбираем строки документа
						 //НомСтр = НомСтр+1;
						 //ищем строку
						 стр = ДокОбъект.ДоговорыОПС.Найти(ВыборкаДетальныеЗаписи.НомерСтроки,"НомерСтроки");
						 Если стр<>Неопределено Тогда
							 стр.ПроцентДохода = стрНач.Процент;
							 стр.СуммаДохода = ОКР(стр.РублеДни*стрНач.Процент/(ДнейВГоду*100),2,1);
						 КонецЕсли;
					 КонецЦикла;
					 //перед записью средний процент и суммарный доход
					 ДокОбъект.СуммаДохода = ДокОбъект.ДоговорыОПС.Итог("СуммаДохода");
					 Если ДокОбъект.ДоговорыОПС.Итог("Рубледни")<>0 Тогда 
						 ДокОбъект.ПроцентДохода = ДокОбъект.СуммаДохода*ДнейВГоду*100/ДокОбъект.ДоговорыОПС.Итог("Рубледни");
					 КонецЕсли;
					#Вставка
					//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
					ФактическаяСуммаРаспределения = ФактическаяСуммаРаспределения + ДокОбъект.СуммаДохода;
					#КонецВставки
					 ДокОбъект.ОбменДанными.Загрузка = Истина;
					 ДокОбъект.Записать();
				 КонецЦикла;
			 Иначе
				 Сообщить("Некорректное распределение.");
			 КонецЕсли;
		 КонецЕсли;	
	 КонецЦикла;
 	#Вставка
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
	Сообщить("Фактическая сумма распределение = "+ФактическаяСуммаРаспределения);
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ПровестиСозданныеДокументы")
Процедура ХМПровестиСозданныеДокументы(Объект)
	Для каждого стр из Объект.НовыеНачисления Цикл
		#Вставка 
		Попытка // ЛыткинАМ ПровестиСозданныеДокументы
		#КонецВставки
		Если ТипЗнч(стр.Документ)<> Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
			Док = стр.Документ.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;
		#Вставка 
		//+ ЛыткинАМ ПровестиСозданныеДокументы	
		Исключение
			Сообщить(""+стр.Документ+":"+ОписаниеОшибки());
		КонецПопытки;
		//- ЛыткинАМ ПровестиСозданныеДокументы	
		#КонецВставки		
	КонецЦикла;
КонецПроцедуры   

Процедура ХМ_НеТиповыеИзменения()
	//ЛыткинАМ ПровестиСозданныеДокументы	
КонецПРоцедуры
